<template>
    <div>
        <h1>Уведомления</h1>
        <b-card no-body>
            <b-table striped hover :items="items"></b-table>
        </b-card>
    </div>
</template>

<script>
    export default {
        name: "Notifications",
        data() {
            return {
                items: [
                    {дата: '12.12.2020', тип: 'system', Сообщение: 'Для вас появились новые проекты'},
                    {дата: '12.12.2020', тип: 'system', Сообщение: 'Вы вступили в проект Хакуна матата'},
                    {дата: '12.12.2020',тип: 'payment', Сообщение: 'Баланс пополнен на 1000р', last_name: 'Shaw', _rowVariant: 'danger'},
                    {дата: '12.12.2020',тип: 'system', Сообщение: 'Для вас появились новые проекты'},
                    {дата: '12.12.2020',тип: 'system', Сообщение: 'Проект -хакуна матата-  закрыт'},
                    {дата: '12.12.2020', тип: 'system', Сообщение: 'Для вас появились новые проекты'},
                    {дата: '12.12.2020',тип: 'payment', Сообщение: 'Баланс пополнен на 1000р', last_name: 'Shaw', _rowVariant: 'danger'},
                    {дата: '12.12.2020',тип: 'system', Сообщение: 'Для вас появились новые проекты'},
                    {дата: '12.12.2020',тип: 'system', Сообщение: 'Проект -хакуна матата-  закрыт'}
                ]
            }

        }
    }
</script>

<style scoped>

</style>