<!DOCTYPE html>
<html lang="{{ str_replace('_', '-', app()->getLocale()) }}" id="id01">
<head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">

    <title>ООО «ТРУБКА.ПРО» - Правила в отношении использования файлов cookie</title>

    <!-- Fonts -->
    <link href="https://fonts.googleapis.com/css?family=Nunito:200,600" rel="stylesheet">
    <link rel="preconnect" href="https://fonts.gstatic.com">
    <link href="https://fonts.googleapis.com/css2?family=Montserrat:ital,wght@0,200;0,300;0,400;0,500;0,600;0,700;0,800;1,100&display=swap" rel="stylesheet">
    <link href='/css/app.css' rel='stylesheet' type='text/css'>
    <link href='/css/app.css' rel='stylesheet' type='text/css'>

</head>
<body>
<div class="rules-text">
    <div><h1>Правила в отношении использования файлов cookie</h1></div>
    <br/>
    <div></div>
    <div>Посещая сайт www.trubka.pro в сети &laquo;Интернет&raquo;, принадлежащий ООО &laquo;ТРУБКА.ПРО&raquo;, посетитель</div>
    <div>сайта соглашается с настоящими правилами, в том числе с тем, что ООО &laquo;ТРУБКА.ПРО&raquo; может</div>
    <div>использовать файлы cookie и иные данные для их последующей обработки системами Google</div>
    <div>Analytics, Яндекс.Метрика, Firebase, Appsflyer и др., а также может передавать их третьим лицам</div>
    <div>для проведения исследований, выполнения работ или оказания услуг.</div>
    <div>Определение термина &laquo;файлы cookie&raquo;</div>
    <div>Файлы cookie &ndash; текстовые файлы небольшого размера, которые сохраняются на вашем устройстве</div>
    <div>(персональном компьютере, ноутбуке, планшете, мобильном телефоне и т.п.), когда вы посещаете</div>
    <div>сайты в сети &laquo;Интернет&raquo;. Кроме того, при посещении сайта www . trubka . pro сети &laquo;Интернет&raquo;</div>
    <div>происходит автоматический сбор иных данных, в том числе: технических характеристик</div>
    <div>устройства, IP-адреса, информации об используемом браузере и языке, даты и времени доступа к</div>
    <div>сайту, адресов запрашиваемых страниц сайта и иной подобной информации.</div>
    <div>Виды используемых файлов cookie</div>
    <div>В зависимости от используемых посетителями сайта браузера и устройств используются разные</div>
    <div>наборы файлов cookie, включающие в себя строго необходимые, эксплуатационные,</div>
    <div>функциональные и аналитические файлы cookie.</div>
    <div>Цели использования файлов cookie</div>
    <div>При посещении посетителями сайта www . trubka . pro в сети &laquo;Интернет&raquo; файлы cookie могут</div>
    <div>использоваться для:</div>
    <div>обеспечения функционирования и безопасности сайта;</div>
    <div>улучшения качества сайта;</div>
    <div>регистрации в системе самообслуживания (личном кабинете);</div>
    <div>предоставления услуг, указанных в</div>
    <div>Перечне платных услуг &mdash; Приложение №1 к</div>
    <div>Пользовательскому соглашению</div>
    <div>усовершенствования продуктов и (или) услуг и для разработки новых продуктов и (или) услуг.</div>
    <div>Иная собираемая информация может быть использована для генерации &laquo;списка интересов&raquo;</div>
    <div>посетителей сайта, состоящего из случайного идентификатора, категории интереса и отметки</div>
    <div>времени для демонстрации посетителям сайта интернет-контента.</div>
    <div>Способы управления файлами cookie</div>
    <div>Используемые посетителями сайта браузер и (или) устройство могут позволять посетителям сайта</div>
    <div>блокировать, удалять или иным образом ограничивать использование фалов cookie. Но файлы</div>
    <div>cookie являются важной частью сайта www . trubka . pro в сети &laquo;Интернет&raquo;, поэтому блокировка,</div>
    <div>удаление или ограничение их использования может привести к тому, что посетители сайта будут</div>
    <div>иметь доступ не ко всем функциям сайта. Чтобы узнать, как управлять файлами cookie с помощью</div>
    <div>используемых посетителями сайта браузера или устройства, посетители сайта могут</div>
    <div>воспользоваться инструкцией, предоставляемой разработчиком браузера или производителем</div>
    <div>устройства.</div>
</div>
</body>
</html>

