export const LEAD_CRITERION_1 = 1;
export const LEAD_CRITERION_2 = 2;
export const LEAD_CRITERION_3 = 3;
export const LEAD_CRITERION_4 = 4;
export const LEAD_CRITERION_5 = 5;

export const LEAD_CRITERION_NAMES = {
    [LEAD_CRITERION_1]: 'контактное лицо принимает решение/влияет на принятие решения по обозначенной зоне ответственности',
    [LEAD_CRITERION_2]: 'контактное лицо понимает суть предложения Заказчика',
    [LEAD_CRITERION_3]: 'контактное лицо готово к контакту со специалистом Заказчика не позднее чем в течение 7 календарных дней с момента контакта оператора',
    [LEAD_CRITERION_4]: 'контактное лицо подвердило наличие минимального бюджета _______ и отсутствие ограничений к заключению договора в течение _______ месяцев',
    [LEAD_CRITERION_5]: 'контактное лицо занимает одну из перечисленных должностей (через запятую):',
};
